ᴄʟᴀss Txᴛ(ᴏʙJᴇᴄᴛ):

    PRIVATE_START_MSG = """
Hɪ {},

I'ᴍ Fɪʟᴇs Eɴᴄᴏᴅᴇʀ ʙᴏᴛ ᴄᴀɴ ᴅᴏ ᴄᴏᴍᴘʀᴇss ʏᴏᴜʀ ғɪʟᴇs ɪɴ ɴᴇɢʟɪɢɪʙʟᴇ ᴡɪᴛʜᴏᴜᴛ ʟᴏss ᴏғ ǫᴜᴀʟɪᴛɪᴇs ᴊᴜsᴛ sᴇɴᴅ ᴍᴇ ᴠɪᴅᴇᴏ
"""
    GROUP_START_MSG = """
Hɪ {},

I'ᴍ Fɪʟᴇs Eɴᴄᴏᴅᴇʀ ʙᴏᴛ ᴄᴀɴ ᴄᴏᴍᴘʀᴇss ʏᴏᴜʀ ғɪʟᴇs ᴛᴏ ɴᴇɢʟɪɢɪʙʟᴇ sɪᴢᴇ ᴡɪᴛʜᴏᴜᴛ ʟᴏᴏsɪɴɢ ᴛʜᴇ ǫᴜᴀʟɪᴛɪᴇs ᴊᴜsᴛ sᴇɴᴅ ᴍᴇ ᴠɪᴅᴇᴏ

❗Yᴏᴜ ʜᴀsɴ'ᴛ sᴛᴀʀᴛᴇᴅ ᴍᴇ ʏᴇᴛ ᴛᴏ ᴜsᴇ ᴍᴇ ғɪʀsᴛ sᴛᴀʀᴛ ᴍᴇ sᴏ ɪ ᴄᴀɴ ᴡᴏʀᴋ ғʟᴀᴡʟᴇssʟʏ
"""
    PROGRESS_BAR = """<ʙ>
╭━━━━❰ᴘʀᴏɢʀᴇss ʙᴀʀ❱━➣
┣⪼ 🗃️ Sɪᴢᴇ: {𝟷} | {𝟸}
┣⪼ ⏳️ Dᴏɴᴇ : {𝟶}%
┣⪼ 🚀 Sᴩᴇᴇᴅ: {𝟹}/s
┣⪼ ⏰️ Eᴛᴀ: {𝟺}
╰━━━━━━━━━━━━━━━➣ """

    SEND_FFMPEG_CODE = """
❪ SET CUSTOM FFMPEG CODE ❫

Sᴇɴᴅ ᴍᴇ ᴛʜᴇ ᴄᴏʀʀᴇᴄᴛ ғғᴍᴘᴇɢ ᴄᴏᴅᴇ ғᴏʀ ᴍᴏʀᴇ ɪɴғᴏ.


☛ <ᴀ ʜʀᴇғ=ʜᴛᴛᴘs://ᴜɴɪx.sᴛᴀᴄᴋᴇxᴄʜᴀɴɢᴇ.ᴄᴏᴍ/ǫᴜᴇsᴛɪᴏɴs/𝟸𝟾𝟾𝟶𝟹/ʜᴏᴡ-ᴄᴀɴ-ɪ-ʀᴇᴅᴜᴄᴇ-ᴀ-ᴠɪᴅᴇᴏs-sɪᴢᴇ-ᴡɪᴛʜ-ғғᴍᴘᴇɢ#:~:ᴛᴇxᴛ=ғғᴍᴘᴇɢ%𝟸𝟶%𝟸Dɪ%𝟸𝟶ɪɴᴘᴜᴛ.ᴍᴘ𝟺%𝟸𝟶%𝟸Dᴠᴄᴏᴅᴇᴄ%𝟸𝟶ʟɪʙx𝟸𝟼𝟻%𝟸𝟶%𝟸Dᴄʀғ%𝟸𝟶𝟸𝟾%𝟸𝟶ᴏᴜᴛᴘᴜᴛ.ᴍᴘ𝟺> FOR HELP 

⦿ Fᴏʀᴍᴀᴛ Oɴ Hᴏᴡ Tᴏ Sᴇᴛ

☞ ғғᴍᴘᴇɢ -ɪ ɪɴᴘᴜᴛ.ᴍᴘ𝟺 <ᴄᴏᴅᴇ> -ᴄ:ᴠ ʟɪʙx𝟸𝟼𝟺 -ᴄʀғ 𝟸𝟹  ᴏᴜᴛᴘᴜᴛ.ᴍᴘ𝟺

<ᴄᴏᴅᴇ> -ᴄ:ᴠ ʟɪʙx𝟸𝟼𝟺 -ᴄʀғ 𝟸𝟹  Tʜɪs ɪs ʏᴏᴜʀ ғғᴍᴘᴇɢ ᴄᴏᴅᴇ ✅

📥 Fᴏʀ Hᴇʟᴘ Cᴏɴᴛ. @Kʀɪsʜɴᴀ𝟿𝟿𝟾𝟾𝟽𝟽𝟸𝟸
"""

    SEND_METADATA ="""
❪ SET CUSTOM METADATA ❫

☞ Fᴏʀ Exᴀᴍᴘʟᴇ:-

◦ <ᴄᴏᴅᴇ> -ᴍᴀᴘ 𝟶 -ᴄ:s ᴄᴏᴘʏ -ᴄ:ᴀ ᴄᴏᴘʏ -ᴄ:ᴠ ᴄᴏᴘʏ -ᴍᴇᴛᴀᴅᴀᴛᴀ ᴛɪᴛʟᴇ="Mʏ Vɪᴅᴇᴏ" -ᴍᴇᴛᴀᴅᴀᴛᴀ ᴀᴜᴛʜᴏʀ="Jᴏʜɴ Dᴏᴇ" -ᴍᴇᴛᴀᴅᴀᴛᴀ:s:s ᴛɪᴛʟᴇ="Sᴜʙᴛɪᴛʟᴇ Tɪᴛʟᴇ" -ᴍᴇᴛᴀᴅᴀᴛᴀ:s:ᴀ ᴛɪᴛʟᴇ="Aᴜᴅɪᴏ Tɪᴛʟᴇ" -ᴍᴇᴛᴀᴅᴀᴛᴀ:s:ᴠ ᴛɪᴛʟᴇ="Vɪᴅᴇᴏ Tɪᴛʟᴇ" 

📥 Fᴏʀ Hᴇʟᴘ Cᴏɴᴛ. @Kʀɪsʜɴᴀ𝟿𝟿𝟾𝟾𝟽𝟽𝟸𝟸
"""

    
    HELP_MSG = """
Aᴠᴀɪʟᴀʙʟᴇ ᴄᴏᴍᴍᴀɴᴅs:-

➜ /sᴇᴛ_ғғᴍᴘᴇɢ - Tᴏ sᴇᴛ ᴄᴜsᴛᴏᴍ ғғᴍᴘᴇɢ ᴄᴏᴅᴇ
➜ /sᴇᴛ_ᴍᴇᴛᴀᴅᴀᴛᴀ - Tᴏ sᴇᴛ ᴄᴜsᴛᴏᴍ ᴍᴇᴛᴀᴅᴀᴛᴀ ᴄᴏᴅᴇ
➜ /sᴇᴛ_ᴄᴀᴘᴛɪᴏɴ - Tᴏ sᴇᴛ ᴄᴜsᴛᴏᴍ ᴄᴀᴘᴛɪᴏɴ
➜ /ᴅᴇʟ_ғғᴍᴘᴇɢ - Dᴇʟᴇᴛᴇ ᴛʜᴇ ᴄᴜsᴛᴏᴍ ғғᴍᴘᴇɢ ᴄᴏᴅᴇ
➜ /ᴅᴇʟ_ᴄᴀᴘᴛɪᴏɴ - Dᴇʟᴇᴛᴇ ᴄᴀᴘᴛɪᴏɴ
➜ /sᴇᴇ_ғғᴍᴘᴇɢ - Vɪᴇᴡ ᴄᴜsᴛᴏᴍ ғғᴍᴘᴇɢ ᴄᴏᴅᴇ
➜ /sᴇᴇ_ᴍᴇᴛᴀᴅᴀᴛᴀ - Vɪᴇᴡ ᴄᴜsᴛᴏᴍ ᴍᴇᴛᴀᴅᴀᴛᴀ ᴄᴏᴅᴇ
➜ /sᴇᴇ_ᴄᴀᴘᴛɪᴏɴ - Vɪᴇᴡ ᴄᴀᴘᴛɪᴏɴ 
➜ Tᴏ Sᴇᴛ Tʜᴜᴍʙɴᴀɪʟ Jᴜsᴛ sᴇɴᴅ ᴘʜᴏᴛᴏ


<ʙ>⦿ Dᴇᴠᴇʟᴏᴘᴇʀ: <ᴀ ʜʀᴇғ=ʜᴛᴛᴘs://ᴛ.ᴍᴇ/Kʀɪsʜɴᴀ𝟿𝟿𝟾𝟾𝟽𝟽𝟸𝟸>Kʀɪsʜɴᴀ 🔥
"""

    ABOUT_TXT = """<ʙ>╭───────────⍟
├🤖 ᴍʏ ɴᴀᴍᴇ : @{}
├👨‍💻 Pʀᴏɢʀᴀᴍᴇʀ : <ᴀ ʜʀᴇғ=ʜᴛᴛᴘs://ᴛ.ᴍᴇ/Kʀɪsʜɴᴀ𝟿𝟿𝟾𝟾𝟽𝟽𝟸𝟸>KRISHNA
├☃️ ꜰᴏᴜɴᴅᴇʀ ᴏꜰ : <ᴀ ʜʀᴇғ=ʜᴛᴛᴘs://ᴛ.ᴍᴇ/+Aɴɪᴍᴇs_Iɴᴅɪᴀ_ʙᴏᴛ>Aɴɪᴍᴇs Iɴᴅɪᴀ ʙᴏᴛ
├📕 Lɪʙʀᴀʀʏ : <ᴀ ʜʀᴇғ=ʜᴛᴛᴘs://ɢɪᴛʜᴜʙ.ᴄᴏᴍ/ᴘʏʀᴏɢʀᴀᴍ>Pʏʀᴏɢʀᴀᴍ
├✏️ Lᴀɴɢᴜᴀɢᴇ: <ᴀ ʜʀᴇғ=ʜᴛᴛᴘs://ᴡᴡᴡ.ᴘʏᴛʜᴏɴ.ᴏʀɢ>Pʏᴛʜᴏɴ 𝟹
├💾 Dᴀᴛᴀ Bᴀꜱᴇ: <ᴀ ʜʀᴇғ=ʜᴛᴛᴘs://ᴄʟᴏᴜᴅ.ᴍᴏɴɢᴏᴅʙ.ᴄᴏᴍ>Mᴏɴɢᴏ DB
├🌀 ᴍʏ ꜱᴇʀᴠᴇʀ : <ᴀ ʜʀᴇғ=ʜᴛᴛᴘs://ᴅᴀsʜʙᴏᴀʀᴅ.ʜᴇʀᴏᴋᴜ.ᴄᴏᴍ>Hᴇʀᴏᴋᴜ
╰───────────────⍟ """
